export const careerHistory = [
  "2025. 여수한려초 5학년 및 연구부장(연구학교 주무)",
  "2025. 돌산초등학교(도지정 연구학교-연구 주제: 수업혁신) 협의체 위원",
  "2025. 독서인문 선도교실 운영교사",
  "2025. 지식샘터 지원단",
  "2025. 아고라 순천 생활예술팀 공연단",
  "2024. 여수한려초 5학년 및 생활부장",
  "2024. AIDT 지원단",
  "2024. 에듀테크 현장 지원단 2기",
  "2024. KENTEC 미래 교육 전문 강사 이어짐 교사 2기 (미네르바 팀, AI 팀 소속)",
  "2024. 교실혁명 선도교사(교육부)",
  "2024. 아이에답 마스터 교원",
  "2024. 독서인문선도교실 선도교사",
  "여수교육청 발명교육센터 영재 강사(2022~현)",
  "전남초등아카펠라교육연구회 총무(2022~현)",
  "책열매 현장 지원단(교육부)",
  "인디스쿨 운영진 및 콘텐츠 개발팀"
];

export const researchAchievements = [
  {
    title: "2023. 독서인문실천사례 연구대회(2등급)",
    description: "연구 주제: 나와 세상을 바꾸는 RM&W독서인문교육"
  },
  {
    title: "2024. 수업혁신사례 연구대회(전국 2등급)",
    description: "연구 주제: 학생 주도형 A.S.M.R. 프로그램으로 맞춤형 국어과 역량 기르고 다 함께 행복한 미래 교실 만들기"
  },
  {
    title: "2024. 자연관찰탐구방법 개선 연구대회(3등급)",
    description: "연구 주제: 독서 토론 글쓰기를 통한 과학적 문해력 기르기"
  },
  {
    title: "2024. 과학교육방법개선 연구대회(3등급)",
    description: "연구 주제: 일체형 인덕션 청소기 제작을 통한 학생 주도형 발명 교육의 실재"
  }
];

export const schoolResearch = [
  {
    title: "2025. 지역역사연계 독서인문 선도학교(시지정 연구 1년, 여수한려초)",
    description: "연구 주제: 글로-CAL 프로젝트를 통해 여수 사랑義 미래 인재 기르기",
    link: "https://padlet.com/gmlduqzhd12/2025-rlimw85xg5ced653"
  }
];

export const publicClasses = [
  "2023. 제 3차 전남교과교육연구회 공개 수업(실과과)",
  "2023. 제 4차 전남교과교육연구회 공개 수업 보조(음악과)",
  "2024. 제 2회 전남교과교육연구회 공개 수업(국어과)",
  "2024. 글로컬 미래 교실 공동 공개 수업(국어과)",
  "2024. 독서인문 선도교실 공개수업(2회)"
];

export const studentMentoring = [
  "Yes24 전국 어린이 독후감 대회 단체상 - 최우수상(2023)",
  "Yes24 전국 어린이 독후감 대회 단체상 - 우수상(2021, 2022)",
  "제25회 전국통계활용대회 - 전남 1위, 전국 4위",
  "제23회 불조심 어린이 마당 - 전남 1위, 전국 7위",
  "2024. 자연관찰탐구대회 은상 수상",
  "2024. 과학탐구토론대회 동상 수상",
  "제 45회 창의융합발명품경진대회 우수상 수상",
  "창의융합인재양성프로젝트 운영 교사(2021~현재)",
  "창의도전페스티벌 지도 교사(2022~현재)",
  "대한민국 창의력챔피언대회 지도 교사(2023~현재)"
];

export const commendations = [
  "2024. 글로컬 미래교육 박람회 유공교원(교육감)",
  "2024. 전남학생발명지도 유공교원(교육감)",
  "2023. 전남학생발명지도 유공교원(교육감)",
  "2023. 통계활용대회 지도교사상(통계청장)",
  "2023. 불조심 어린이마당 지도교사상(교육감)",
  "2022~3. Yes24 어린이 독후감 대회 지도교사상(Yes24 사장상)",
  "2022. 독서토론교육 유공교원(교육감)"
];

export const lecturesAndConsulting = [
  "2022 개정 교육과정 학습자 주도성 수업 연수(7. 13. 전남초등국어교육학회)",
  "2024. 에듀테크 활용 미래교실 수업의 실제(7. 19. 여수교육지원청)",
  "생성형 AI를 활용한 독서인문교육 방법 연수(8. 13. 한국에너지공과대학교)",
  "2024. AIDT 적용 교원 전달 연수 (예울초, 여문초, 여도초, 신월초, 미평초, 무선초, 송현초, 시전초 등 다수)",
  "한국에너지공과대학교 미래 교육 전문가 과정 컨설팅(10. 25. / 10. 28. / 11. 21.)",
  "찾아가는 에듀테크 활용 연수(11. 8. 진남여자중학교)",
  "찾아가는 AI 활용 연수(12. 6. 순천세빛중학교)",
  "찾아가는 학교 맞춤형 컨설팅(도원초등학교)",
  "2025. 독서인문선도교실 우수사례 발표(전라남도교육청)",
  "2025. 학생 작가 프로젝트 컨설팅(여수 2030 연구회)"
];

export const acappellaData = [
  {
    id: 1,
    title: '2024 한국아카펠라교육연구회 페스티벌',
    url: 'https://youtu.be/YuiAVXZRvCk'
  },
  {
    id: 2,
    title: '2024 수석교사 수업 나눔 한마당',
    url: 'https://youtu.be/W3RCAtpL6nc'
  },
  {
    id: 3,
    title: '2024 순천 교장단 회의 식전 공연',
    url: 'https://www.youtube.com/watch?v=KmMNL_u6IRY'
  },
  {
    id: 4,
    title: '2024 대한민국글로컬박람회 축하 공연',
    url: 'https://www.youtube.com/watch?v=mMn49UhsGXg'
  },
  {
    id: 5,
    title: '제 17회 전남초등교원음악제',
    url: 'https://www.youtube.com/watch?v=nK5NRK15LXE'
  },
  {
    id: 6,
    title: '제 16회 전남초등교원음악제',
    url: 'https://www.youtube.com/watch?v=VQ8EAzcwLBo'
  },
  {
    id: 7,
    title: '2024 여수전문적학습공동체 나눔의 날 식전 공연',
    url: 'https://www.youtube.com/watch?v=HtwkKurwMzg'
  },
  {
    id: 8,
    title: '2024 순천전문적학습공동체 나눔의 날 식전 공연',
    url: 'https://www.youtube.com/watch?v=RlX5ErspczU'
  },
  {
    id: 9,
    title: '제1회 전남초등아카펠라교육페스티벌',
    url: 'https://www.youtube.com/watch?v=s7vIY_Rr3hI'
  }
];
